org/Quantum_Processes_A_Whiteheadian_Interpretation_of_Quantum_Field_Theory_by_Frank_Hattich.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: Quantum_Processes_A_Whiteheadian_Interpretation_of_Quantum_Field_Theory_by_Frank_Hattich
#+TITLE: Quantum Processes A Whiteheadian Interpretation of Quantum Field Theory by Frank Hattich
* I. Whitehead's process philosophy
** 1. Actuality
*** Overview
**** Ontology
***** actuality
***** potentiality
**** Connection
***** actuality --> potentiality
****** what exists by way of potentiality is limited or conditioned by actuality
***** potentiality --> actuality
****** what exists by way of actuality arises out of what exists by way of potentiality  
**** Actuality
***** actual occasions = actual entities are the building blocks of actuality
****** there is a process of coming into being (=becoming) of final actualities but they do not arise from nothing
****** each instance is both a becoming and a being: first it is a becoming and then the being that is created by that act of becoming
**** Potentialities
***** eternal potentials ground the becoming of actualities
**** Questions
***** What secures the self-identity of an occasion?
****** In the two different stages of its existence one could consider two distinct entities: the former in the state of becoming to create the latter in the state of being
***** When can the becoming of an occasion be said to create its being?
*** 1.1 The self-creative processes of concrescence
**** 
**** 1.1.1 Concrescence as creative process
**** 1.1.2 Concrescence as non-spatiotemporal process
**** 1.1.3 Genetical supersession
*** 1.2 A comment on the "birth-date" of occasions
*** 1.3 The world-process
**** 1.3.1 Actual worlds
**** 1.3.2 A comment on the concept of evolvement and the openness of the future
** 2. Potentiality's interplay with actuality
*** 2.1 The extensive continuum
*** 2.2 Eternal objects
**** 2.2.1 Ingression and the two species of eternal objects
**** 2.2.2 Simple and complex eternal objects
**** 2.2.3 Comparison with two other theories of universals
**** 2.2.4 The compatibility of eternal objects
**** 2.2.5 Abstractive hierarchies
**** 2.2.6 Functioning of eternal objects in the constitution of occasions
*** 2.3 The underlying activity
**** 2.3.1 The limited and individualized activity of a concrescence process
**** 2.3.2 The individuality of occasions
**** 2.3.3 The envisaging property of the underlying activity
**** 2.3.4 The objective immortality of occasions
*** 2.4 Other-creating processes of transition
**** 2.4.1 The dative phase of a transition process
**** 2.4.2 The conformal phase of a transition process
**** 2.4.3 Transition as deterministic causal process
**** 2.4.4 Transition as non-spatiotemporal process
*** 2.5 Two problems of Whitehead's ontology
**** 2.5.1 The first problem
**** 2.5.2 The second problem
**** 2.5.3 A resolution for both problems
*** 2.6 Bifurcating activities and Whitehead's ontology
**** 2.6.1 Consequences for the individuality of occasions
**** 2.6.2 The creative character of a bifurcating activity
**** 2.6.3 Bifurcating activities and efficient causation
*** 2.7 Order of envisagement and expansion
**** 2.7.1 The order of envisagement and the causal expansion of the world
**** 2.7.2 The spatiotemporal expansion of the world
*** 2.8 On the compatibility with STR
**** 2.8.1 Superluminal causation
**** 2.8.2 Distinguished foliation of spacetime
** 3. A first comparison with quantum physics
*** 3.1 Discrete events
*** 3.2 Autonomous decisions
*** 3.3 Atomicity of actualization
* II. Algebraic quantum field theory
** 4. The role of the algebraic approach
*** Overview
**** An influence of gravitationally interacting matter on the structure of spacetime, like the one described in the macro-realm by the general theory of relativity, is to be expected. But since QFT presupposes a given spacetime as a fixed, unchangeable background structure, its conceptual framework is simply too narrow for being able to include the gravitational interaction.
*** 4.1 The Lagrangian approach
**** [[https://en.wikipedia.org/wiki/Haag%27s_theorem][Haag's theorem]] states that a nonperturbative interacting QFT does not exist in a rigorous mathematical sense within the framework used in the Lagrangian approach
**** the very idea of a quantum field (i.e. a “quantized” classical field) as an assignment of an operator Ψ(x) to each spacetime point x is not tenable from a mathematical point of view.
**** The strategy of the AQFTs was to isolate those features of QFT which could be stated in mathematically rigorous terms and to extract those general postulates which looked trustworthy in the light of the lessons learned from the Lagrangian approach.
*** 4.2 The axiomatic approach
**** Wightman axioms
**** Quantum fields are operator-valued distributions that become well-defined operators in the Hilbert space of state vectors $$\mathcal{H}$$ when being smeared with an appropriate test function $$f$$ with support in an extended region of spacetime $$\mathcal{O}$$
***** $$\Psi(f) = \int \Psi(x) f(x) dx$$
**** Borchers’ result showed that different quantum fields Ψ, Φ can very well lead to the same sets of observables. Since in such a case the observable content of the theory does not depend on the choice of the underlying quantum field Ψ or Φ, this result indicates that a formulation of QFT based on quantum fields contains essential redundancies.
*** 4.3 The algebraic approach
**** The fundamental mathematical structure on which AQFT is based is a correspondence $$\mathcal{O} \mapsto \mathcal{R} (\mathcal{O})$$ between bounded spacetime regions $$\mathcal{O}$$ and operator algebras $$\mathcal{R}(\mathcal{O})$$
**** Self-adjoint elements of the operator algebras are interpreted as the physical magnitudes or observables measurable within spacetime region $$\mathcal{O}$$
**** all relevant physical information is contained in the axioms of AQFT, and thus ultimately in the correspondence between spacetime regions and algebras of observables,
** 5. The standard axioms of AQFT
*** 5.1 Local observables
*** 5.2 States and probabilities
*** 5.3 the further axioms of AQFT
* III. The connection
** 6. The extensive continuum
** 7. Objective eternal objects
** 8. Subjective and mixed eternal objects
*** 8.1 Properties in quantum physics
*** 8.2 "Indirect" representation of eternal objects
*** 8.3 No simple properties in QFT
**** 8.3.1 Consequences for subjective eternal objects
**** 8.3.2 Consequences for abstractive hierarchies
**** 8.3.3 Against conjunctive subjective eternal objects
**** 8.3.4 Simple decisions revisited
*** 8.4 The representation of abstractive hierarchies
** 9. The representation of the underlying activity and its manifestations
*** 9.1 The underlying activity itself
*** 9.2 Its manifestation at some stage
*** 9.3 Reinterpreting probability statements
** 10. Representing transition processes
*** 10.1 The dative phase I
*** 10.2 Bell's theorem, non-separability, and all that
*** 10.3 The dative phase II
*** 10.4 The conformal phase
** 11. Representing concrescence processes
*** 11.1 Hierarchies and activities
*** 11.2 The degree of divisibility of activities
*** 11.3 The degree of individuality of occasions
** 12. Summing Up
* Appendix A: Lattices and Boolean algebras
* Appendix B: Operator algebras on Hilbert spaces
** B.1 Hilbert spaces
** B.2 Bounded operators
** B.3 Algebras of bounded operators
