content/posts/Quantum_Processes_A_Whiteheadian_Interpretation_of_Quantum_Field_Theory_by_Frank_Hattich.md
+++
title = "Quantum Processes A Whiteheadian Interpretation of Quantum Field Theory by Frank Hattich"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:41-04:00
slug = "Quantum_Processes_A_Whiteheadian_Interpretation_of_Quantum_Field_Theory_by_Frank_Hattich"
draft = false
+++

## I. Whitehead's process philosophy {#i-dot-whitehead-s-process-philosophy}


### 1. Actuality {#1-dot-actuality}

<!--list-separator-->

-  Overview

    <!--list-separator-->

    -  Ontology

        <!--list-separator-->

        -  actuality

        <!--list-separator-->

        -  potentiality

    <!--list-separator-->

    -  Connection

        <!--list-separator-->

        -  actuality --> potentiality

            <!--list-separator-->

            -  what exists by way of potentiality is limited or conditioned by actuality

        <!--list-separator-->

        -  potentiality --> actuality

            <!--list-separator-->

            -  what exists by way of actuality arises out of what exists by way of potentiality

    <!--list-separator-->

    -  Actuality

        <!--list-separator-->

        -  actual occasions = actual entities are the building blocks of actuality

            <!--list-separator-->

            -  there is a process of coming into being (=becoming) of final actualities but they do not arise from nothing

            <!--list-separator-->

            -  each instance is both a becoming and a being: first it is a becoming and then the being that is created by that act of becoming

    <!--list-separator-->

    -  Potentialities

        <!--list-separator-->

        -  eternal potentials ground the becoming of actualities

    <!--list-separator-->

    -  Questions

        <!--list-separator-->

        -  What secures the self-identity of an occasion?

            <!--list-separator-->

            -  In the two different stages of its existence one could consider two distinct entities: the former in the state of becoming to create the latter in the state of being

        <!--list-separator-->

        -  When can the becoming of an occasion be said to create its being?

<!--list-separator-->

-  1.1 The self-creative processes of concrescence

    <!--list-separator-->

    -

    <!--list-separator-->

    -  1.1.1 Concrescence as creative process

    <!--list-separator-->

    -  1.1.2 Concrescence as non-spatiotemporal process

    <!--list-separator-->

    -  1.1.3 Genetical supersession

<!--list-separator-->

-  1.2 A comment on the "birth-date" of occasions

<!--list-separator-->

-  1.3 The world-process

    <!--list-separator-->

    -  1.3.1 Actual worlds

    <!--list-separator-->

    -  1.3.2 A comment on the concept of evolvement and the openness of the future


### 2. Potentiality's interplay with actuality {#2-dot-potentiality-s-interplay-with-actuality}

<!--list-separator-->

-  2.1 The extensive continuum

<!--list-separator-->

-  2.2 Eternal objects

    <!--list-separator-->

    -  2.2.1 Ingression and the two species of eternal objects

    <!--list-separator-->

    -  2.2.2 Simple and complex eternal objects

    <!--list-separator-->

    -  2.2.3 Comparison with two other theories of universals

    <!--list-separator-->

    -  2.2.4 The compatibility of eternal objects

    <!--list-separator-->

    -  2.2.5 Abstractive hierarchies

    <!--list-separator-->

    -  2.2.6 Functioning of eternal objects in the constitution of occasions

<!--list-separator-->

-  2.3 The underlying activity

    <!--list-separator-->

    -  2.3.1 The limited and individualized activity of a concrescence process

    <!--list-separator-->

    -  2.3.2 The individuality of occasions

    <!--list-separator-->

    -  2.3.3 The envisaging property of the underlying activity

    <!--list-separator-->

    -  2.3.4 The objective immortality of occasions

<!--list-separator-->

-  2.4 Other-creating processes of transition

    <!--list-separator-->

    -  2.4.1 The dative phase of a transition process

    <!--list-separator-->

    -  2.4.2 The conformal phase of a transition process

    <!--list-separator-->

    -  2.4.3 Transition as deterministic causal process

    <!--list-separator-->

    -  2.4.4 Transition as non-spatiotemporal process

<!--list-separator-->

-  2.5 Two problems of Whitehead's ontology

    <!--list-separator-->

    -  2.5.1 The first problem

    <!--list-separator-->

    -  2.5.2 The second problem

    <!--list-separator-->

    -  2.5.3 A resolution for both problems

<!--list-separator-->

-  2.6 Bifurcating activities and Whitehead's ontology

    <!--list-separator-->

    -  2.6.1 Consequences for the individuality of occasions

    <!--list-separator-->

    -  2.6.2 The creative character of a bifurcating activity

    <!--list-separator-->

    -  2.6.3 Bifurcating activities and efficient causation

<!--list-separator-->

-  2.7 Order of envisagement and expansion

    <!--list-separator-->

    -  2.7.1 The order of envisagement and the causal expansion of the world

    <!--list-separator-->

    -  2.7.2 The spatiotemporal expansion of the world

<!--list-separator-->

-  2.8 On the compatibility with STR

    <!--list-separator-->

    -  2.8.1 Superluminal causation

    <!--list-separator-->

    -  2.8.2 Distinguished foliation of spacetime


### 3. A first comparison with quantum physics {#3-dot-a-first-comparison-with-quantum-physics}

<!--list-separator-->

-  3.1 Discrete events

<!--list-separator-->

-  3.2 Autonomous decisions

<!--list-separator-->

-  3.3 Atomicity of actualization


## II. Algebraic quantum field theory {#ii-dot-algebraic-quantum-field-theory}


### 4. The role of the algebraic approach {#4-dot-the-role-of-the-algebraic-approach}

<!--list-separator-->

-  Overview

    <!--list-separator-->

    -  An influence of gravitationally interacting matter on the structure of spacetime, like the one described in the macro-realm by the general theory of relativity, is to be expected. But since QFT presupposes a given spacetime as a fixed, unchangeable background structure, its conceptual framework is simply too narrow for being able to include the gravitational interaction.

<!--list-separator-->

-  4.1 The Lagrangian approach

    <!--list-separator-->

    -  [Haag's theorem](<https://en.wikipedia.org/wiki/Haag%27s%5Ftheorem>) states that a nonperturbative interacting QFT does not exist in a rigorous mathematical sense within the framework used in the Lagrangian approach

    <!--list-separator-->

    -  the very idea of a quantum field (i.e. a “quantized” classical field) as an assignment of an operator Ψ(x) to each spacetime point x is not tenable from a mathematical point of view.

    <!--list-separator-->

    -  The strategy of the AQFTs was to isolate those features of QFT which could be stated in mathematically rigorous terms and to extract those general postulates which looked trustworthy in the light of the lessons learned from the Lagrangian approach.

<!--list-separator-->

-  4.2 The axiomatic approach

    <!--list-separator-->

    -  Wightman axioms

    <!--list-separator-->

    -  Quantum fields are operator-valued distributions that become well-defined operators in the Hilbert space of state vectors \\[\mathcal{H}\\] when being smeared with an appropriate test function \\[f\\] with support in an extended region of spacetime \\[\mathcal{O}\\]

        <!--list-separator-->

        -  \\[\Psi(f) = \int \Psi(x) f(x) dx\\]

    <!--list-separator-->

    -  Borchers’ result showed that different quantum fields Ψ, Φ can very well lead to the same sets of observables. Since in such a case the observable content of the theory does not depend on the choice of the underlying quantum field Ψ or Φ, this result indicates that a formulation of QFT based on quantum fields contains essential redundancies.

<!--list-separator-->

-  4.3 The algebraic approach

    <!--list-separator-->

    -  The fundamental mathematical structure on which AQFT is based is a correspondence \\[\mathcal{O} \mapsto \mathcal{R} (\mathcal{O})\\] between bounded spacetime regions \\[\mathcal{O}\\] and operator algebras \\[\mathcal{R}(\mathcal{O})\\]

    <!--list-separator-->

    -  Self-adjoint elements of the operator algebras are interpreted as the physical magnitudes or observables measurable within spacetime region \\[\mathcal{O}\\]

    <!--list-separator-->

    -  all relevant physical information is contained in the axioms of AQFT, and thus ultimately in the correspondence between spacetime regions and algebras of observables,


### 5. The standard axioms of AQFT {#5-dot-the-standard-axioms-of-aqft}

<!--list-separator-->

-  5.1 Local observables

<!--list-separator-->

-  5.2 States and probabilities

<!--list-separator-->

-  5.3 the further axioms of AQFT


## III. The connection {#iii-dot-the-connection}


### 6. The extensive continuum {#6-dot-the-extensive-continuum}


### 7. Objective eternal objects {#7-dot-objective-eternal-objects}


### 8. Subjective and mixed eternal objects {#8-dot-subjective-and-mixed-eternal-objects}

<!--list-separator-->

-  8.1 Properties in quantum physics

<!--list-separator-->

-  8.2 "Indirect" representation of eternal objects

<!--list-separator-->

-  8.3 No simple properties in QFT

    <!--list-separator-->

    -  8.3.1 Consequences for subjective eternal objects

    <!--list-separator-->

    -  8.3.2 Consequences for abstractive hierarchies

    <!--list-separator-->

    -  8.3.3 Against conjunctive subjective eternal objects

    <!--list-separator-->

    -  8.3.4 Simple decisions revisited

<!--list-separator-->

-  8.4 The representation of abstractive hierarchies


### 9. The representation of the underlying activity and its manifestations {#9-dot-the-representation-of-the-underlying-activity-and-its-manifestations}

<!--list-separator-->

-  9.1 The underlying activity itself

<!--list-separator-->

-  9.2 Its manifestation at some stage

<!--list-separator-->

-  9.3 Reinterpreting probability statements


### 10. Representing transition processes {#10-dot-representing-transition-processes}

<!--list-separator-->

-  10.1 The dative phase I

<!--list-separator-->

-  10.2 Bell's theorem, non-separability, and all that

<!--list-separator-->

-  10.3 The dative phase II

<!--list-separator-->

-  10.4 The conformal phase


### 11. Representing concrescence processes {#11-dot-representing-concrescence-processes}

<!--list-separator-->

-  11.1 Hierarchies and activities

<!--list-separator-->

-  11.2 The degree of divisibility of activities

<!--list-separator-->

-  11.3 The degree of individuality of occasions


### 12. Summing Up {#12-dot-summing-up}


## Appendix A: Lattices and Boolean algebras {#appendix-a-lattices-and-boolean-algebras}


## Appendix B: Operator algebras on Hilbert spaces {#appendix-b-operator-algebras-on-hilbert-spaces}


### B.1 Hilbert spaces {#b-dot-1-hilbert-spaces}


### B.2 Bounded operators {#b-dot-2-bounded-operators}


### B.3 Algebras of bounded operators {#b-dot-3-algebras-of-bounded-operators}
